# HW4 Part 1 - RDB programming

In [1]:
# Please edit 
print("Student name : {}".format("YunDa Tsai"))
print("Student ID : {}".format("R08946007"))

In [2]:
import os
import numpy as np
## import other libraries
import pandas as pd
import mysql.connector
import sqlalchemy as sql

Write a python program to extract and print out the following information from the student table that your created. To extract information, you shall issue SQL statements from Python.

(1) The information about yourself f (You can use either your name or your student ID to select out yourself.) 15%

In [3]:
sql_engine = sql.create_engine("mysql+mysqlconnector://root:toor@localhost/test")

In [4]:
## create/import table in mysql
df = pd.read_csv('EECS5178_dataset.csv')
df.columns = ['ID', 'identity', 'department', 'grade', 'studentID', 'name', 'EN_name', 'phone', 'email', 'group']
df.to_sql('eecs5178', sql_engine, if_exists='replace')

## print out the table that you have imported 
pd.read_sql_query("select * from EECS5178", sql_engine)

## show the information about yourself
pd.read_sql_query("select * from eecs5178 where studentID = 'r08946007'", sql_engine)

,index,ID,identity,department,grade,studentID,name,EN_name,phone,email,group
0,61,62,校內生,資料科學學程碩士班,一年級,r08946007,蔡昀達,YUN-DA TSAI,None,r08946007@ntu.edu.tw,None

(2) The list of your peer students. The definition of “peer student” is as follows: 15%
* For undergraduate students, your peer students are those in the same department and same year as you.
* For graduate students, your peer students are those in the same graduate program and same year as your.
* Note: If using the above definition, you have only one peer student, you shall relax the definition, in turn, to your whole departement or whole college.

In [8]:
### your code ###
pd.read_sql_query("select * from eecs5178 where (department = '資料科學學程碩士班' and grade = ' 一年級')", sql_engine)
pd.read_sql_query("select * from eecs5178 where (department = '資料科學學程碩士班')", sql_engine)

,index,ID,identity,department,grade,studentID,name,EN_name,phone,email,group
0,61,62,校內生,資料科學學程碩士班,一年級,r08946007,蔡昀達,YUN-DA TSAI,None,r08946007@ntu.edu.tw,None
1,62,63,校內生,資料科學學程碩士班,一年級,r08946010,戴昀柔,"TAI, YUN-JUO",None,r08946010@ntu.edu.tw,None
2,64,65,校內生,資料科學學程碩士班,二年級,r07946007,陳庭安,"CHEN, TING-AN",None,r07946007@ntu.edu.tw,None
3,65,66,校內生,資料科學學程碩士班,二年級,r07946013,吳泓毅,HUNG-YI WU,None,r07946013@ntu.edu.tw,None
4,66,67,校內生,資料科學學程碩士班,二年級,r07946014,李維道,"LEE, WEI-DAO",None,r07946014@ntu.edu.tw,None
5,67,68,校內生,資料科學學程碩士班,二年級,r07946015,許睿修,JUI-HSIU HSU,None,r07946015@ntu.edu.tw,None

(3) The total number of students taking the class, but not counting the sit-in students (旁聽生). 10%

In [6]:
### your code ###
pd.read_sql_query("select count(*) from eecs5178 where department != '旁聽生'", sql_engine)

   count(*)
0        69